export const EVENT_IDS = Object.freeze([
  // A000
  1070, // アドバタイズムービー指定 2016年8月 デフォルト
  1098, // AIR ep. ∞  | 2016年8月前半 マップ1
  1100, // マップボーナス告知 2016年8月前半  |告知1
  1101, // AIR ep. I  | 2016年8月前半 告知1
  1102, // AIR ep. I  | 2016年8月前半 マップ1
  1103, // ORIGIN Fables  | 2016年8月前半 告知1
  1105, // イロドリミドリ  |告知4
  1106, // イロドリミドリ  |マップ4
  1107, // AIR  |告知1
  1108, // AIR  |マップ1
  1109, // あの日見た花の名前を僕達はまだ知らない。  |告知1
  1110, // あの日見た花の名前を僕達はまだ知らない。  |マップ1
  1113, // おすすめ曲 2016年8月

  // A014
  1099, // 曲告知 2016年8月前半  |告知1
  1111, // WORLD'S END曲告知 2016年8月前半  |告知1
  1112, // WORLD'S END曲開放 2016年8月前半
  1114, // ダメージノーツ告知 2016年8月前半  |告知1
  1130, // 曲告知 2016年9月前半  |告知1
  1131, // アドバタイズムービー指定 2016年9月前半 DIVA2016 イロドリ8
  1132, // おすすめ曲 2016年9月
  1133, // 曲告知 2016年9月後半  |告知2
  1134, // 曲開放 2016年9月後半 VARIETY
  1135, // PRIUS! IMPOSSIBLE GIRLS  |告知1
  1136, // PRIUS! IMPOSSIBLE GIRLS  |マップ1
  1137, // WORLD'S END曲告知 2016年9月後半  |告知1
  1138, // WORLD'S END曲開放 2016年9月後半
  1160, // 曲告知 2016年10月前半  |告知1
  1161, // 曲常駐 2016年10月前半 あの花 AIR DIVA
  1162, // 東方永夜抄  |告知1
  1163, // 東方永夜抄  |マップ1
  1164, // 東方紅魔郷  |告知3
  1165, // 東方紅魔郷  |マップ3
  1166, // 東方妖々夢  |告知2
  1167, // 東方妖々夢  |マップ2
  1168, // おすすめ曲 2016年10月
  1169, // 曲告知 2016年10月後半  |告知2
  1170, // 曲開放 2016年10月後半 イロドリ
  1171, // AIR ep. II  | 2016年10月後半 告知2
  1172, // AIR ep. II  | 2016年10月後半 マップ2
  1173, // WORLD'S END曲告知 2016年10月後半  |告知1
  1174, // WORLD'S END曲開放 2016年10月後半
  1175, // アドバタイズムービー指定 2016年10月後半 イロドリ9
  1190, // 曲告知 2016年11月前半  |告知1
  1191, // 曲常駐 2016年11月前半 PRIUS 東方永夜抄
  1192, // 曲常駐 2016年11月前半 ORIGINAL
  1193, // ノーゲーム・ノーライフ  |告知1
  1194, // ノーゲーム・ノーライフ  |マップ1
  1195, // おすすめ曲 2016年11月
  1196, // 曲告知 2016年11月後半  |告知2
  1197, // 曲開放 2016年11月後半 niconico
  1198, // 冴えない彼女の育てかた  |告知2
  1199, // 冴えない彼女の育てかた  |マップ2
  1200, // WORLD'S END曲告知 2016年11月後半  |告知1
  1201, // WORLD'S END曲開放 2016年11月後半
  1220, // 曲告知 2016年12月前半  |告知1
  1221, // 曲常駐 2016年12月前半 ノーゲーム・ノーライフ
  1222, // 干物妹！うまるちゃん  |告知1
  1223, // 干物妹！うまるちゃん  |マップ1
  1224, // アドバタイズムービー指定 2016年12月前半 イロドリ10
  1225, // おすすめ曲 2016年12月
  1226, // 曲告知 2016年12月後半  |告知2
  1227, // 曲開放 2016年12月後半 GAME/言ノ葉
  1228, // AIR ep. III  | 2016年12月後半 告知3
  1229, // AIR ep. III  | 2016年12月後半 マップ3
  1230, // WHITE ALBUM2  |告知2
  1231, // WHITE ALBUM2  |マップ2
  1232, // WORLD'S END曲告知 2016年12月後半  |告知1
  1233, // WORLD'S END曲開放 2016年12月後半

  // A017
  1250, // 曲告知 2017年1月前半  |告知1
  1251, // 曲常駐 2017年1月前半 うまるちゃん
  1252, // 曲常駐 2017年1月前半 ORIGINAL
  1253, // 僕は友達が少ないNEXT  |告知1
  1254, // 僕は友達が少ないNEXT  |マップ1
  1255, // おすすめ曲 2017年1月
  1256, // WORLD'S END曲告知 2017年1月前半  |告知1
  1257, // WORLD'S END曲開放 2017年1月前半
  1258, // 曲告知 2017年1月後半  |告知2
  1259, // 曲開放 2017年1月後半 niconico
  1260, // ミカグラ学園組曲  |告知2
  1261, // ミカグラ学園組曲  |マップ2
]);
