export const EVENT_IDS = Object.freeze([
  // A000
  1098, // AIR ep. ∞  | 2016年8月前半 マップ1
  1102, // AIR ep. I  | 2016年8月前半 マップ1
  1106, // イロドリミドリ  |マップ4
  1172, // AIR ep. II  | 2016年10月後半 マップ2
  1229, // AIR ep. III  | 2016年12月後半 マップ3
  1279, // アドバタイズムービー指定 2017年2月前半 チェンクロ
  1282, // AIR ep. IV  | 2017年2月前半 告知4
  1283, // AIR ep. IV  | 2017年2月前半 マップ4
  1284, // ご注文はうさぎですか？？  |告知1
  1285, // ご注文はうさぎですか？？  |マップ1
  1286, // チェインクロニクル ～ヘクセイタスの閃～  |告知1
  1287, // チェインクロニクル ～ヘクセイタスの閃～  |マップ1
  1288, // あの日見た花の名前を僕達はまだ知らない。  |告知2
  1289, // あの日見た花の名前を僕達はまだ知らない。  |マップ2
  1292, // コース開放 2017年2月前半
  20000, // ACT 115

  // A017
  1280, // 曲告知 2017年2月前半  |告知1
  1290, // 新要素告知 2017年2月前半  |告知1
  1291, // コース告知 2017年2月前半  |告知1
  1293, // WORLD'S END曲告知 2017年2月前半  |告知1
  1294, // WORLD'S END曲開放 2017年2月前半
  1295, // おすすめ曲 2017年2月
  1296, // 曲告知 2017年2月後半  |告知2
  1297, // 曲開放 2017年2月後半 東方 VARIETY GAME
  1298, // WORLD'S END曲告知 2017年2月後半  |告知2
  1299, // WORLD'S END曲開放 2017年2月後半
  1310, // 曲告知 2017年3月前半  |告知1
  1312, // 曲常駐 ごちうさ チェンクロ
  1313, // ばくおん!!  |告知1
  1314, // ばくおん!!  |マップ1
  1315, // PRIUS! IMPOSSIBLE GIRLS  |告知2
  1316, // PRIUS! IMPOSSIBLE GIRLS  |マップ2
  1317, // 蒼き鋼のアルペジオ ‐アルス・ノヴァ‐  |告知2
  1318, // 蒼き鋼のアルペジオ ‐アルス・ノヴァ‐  |マップ2
  1319, // おすすめ曲 2017年3月
  1320, // アドバタイズムービー指定 2017年3月前半 イロドリ11
  1321, // 曲告知 2017年3月後半  |告知2
  1322, // 曲開放 2017年3月後半POPS VARIETY イロドリ
  1323, // きんいろモザイク  |告知1
  1324, // きんいろモザイク  |マップ1
  1325, // WORLD'S END曲告知 2017年3月後半  |告知1
  1326, // WORLD'S END曲開放 2017年3月後半
  1327, // アドバタイズムービー指定 2017年3月後半 イロドリ12
  1328, // WORLD'S END曲告知 2017年4月エイプリルフール  |告知2
  1329, // WORLD'S END曲開放 2017年4月エイプリルフール
  1340, // 曲告知 2017年4月前半  |告知1
  1342, // 曲常駐 ばくおん!!
  1343, // 曲常駐 通常マップ楽曲
  1344, // Tokyo 7th シスターズ  |告知1
  1345, // Tokyo 7th シスターズ  |マップ1
  1346, // カゲロウプロジェクト  |告知2
  1347, // カゲロウプロジェクト  |マップ2
  1348, // おすすめ曲 2017年4月
  1349, // 曲告知 2017年4月後半  |告知2
  1350, // 曲開放 2017年4月後半 イロドリ
  1351, // AIR ep. V  | 2017年4月後半 告知5
  1352, // AIR ep. V  | 2017年4月後半 マップ5
  1353, // アドバタイズムービー指定 2017年4月後半 イロドリ13
  1354, // 曲告知 2017年4月ゴールデンウィーク  |告知1
  1355, // 曲開放 2017年4月ゴールデンウィーク ORIGINAL
  1356, // WORLD'S END曲告知 2017年4月後半  |告知1
  1357, // WORLD'S END曲開放 2017年4月後半
  1370, // 曲告知 2017年5月前半  |告知1
  1372, // 曲常駐 きんモザ 7thシス
  1373, // イロドリミドリ  |告知5
  1374, // イロドリミドリ  |マップ5
  1375, // 東方Extra  |告知1
  1376, // 東方Extra  |マップ1
  1377, // コース告知 2017年5月前半  |告知1
  1378, // コース開放 2017年5月前半
  1379, // おすすめ曲 2017年5月
  1380, // 曲告知 2017年5月後半  |告知2
  1381, // 曲開放 2017年5月後半 東方 イロドリ
  1382, // 東方紅魔郷  |告知4
  1383, // 東方紅魔郷  |マップ4
  1384, // 東方妖々夢  |告知3
  1385, // 東方妖々夢  |マップ3
  1386, // 東方永夜抄  |告知2
  1387, // 東方永夜抄  |マップ2
  1388, // アドバタイズムービー指定 2017年5月後半 イロドリ14
  1400, // 曲告知 2017年6月前半  |告知1
  1402, // 曲常駐 東方Extra
  1403, // 三者三葉  |告知1
  1404, // 三者三葉  |マップ1
  1405, // 干物妹！うまるちゃん  |告知2
  1406, // 干物妹！うまるちゃん  |マップ2
  1407, // おすすめ曲 2017年6月
  1408, // 曲告知 2017年6月後半  |告知2
  1409, // 曲開放 2017年6月後半 イロドリ
  1410, // AIR ep. VI  | 2017年6月後半 告知6
  1411, // AIR ep. VI  | 2017年6月後半 マップ6
  1412, // WORLD'S END曲告知 2017年6月後半  |告知1
  1413, // WORLD'S END曲開放 2017年6月後半
  1414, // アドバタイズムービー指定 2017年6月後半 イロドリ15
  1415, // 曲告知 2017年6月maimai稼働  |告知1
  1416, // 曲開放 2017年6月maimai稼働 ORIGINAL
  1430, // 曲告知 2017年7月前半  |告知1
  1432, // 曲常駐 三者三葉
  1433, // 曲常駐 通常マップ楽曲2
  1434, // イロドリミドリ  |告知6
  1435, // イロドリミドリ  |マップ6
  1436, // Angel Beats!  |告知1
  1437, // Angel Beats!  |マップ1
  1438, // AIR  |告知2
  1439, // AIR  |マップ2
  1440, // おすすめ曲 2017年7月
  1441, // アドバタイズムービー指定 2017年7月前半 イロドリ16
  1442, // 曲告知 2017年7月後半  |告知2
  1443, // 曲開放 2017年7月後半 VARIETY
  1444, // AIR ep. VII  | 2017年7月後半 告知7
  1445, // AIR ep. VII  | 2017年7月後半 マップ7
  1446, // コース告知 2017年7月後半  |告知1
  1447, // コース開放 2017年7月後半

  // A020
  1460, // 曲常駐 通常マップ楽曲3
  1461, // 言ノ葉Project  |告知1
  1462, // 言ノ葉Project  |マップ1
  1463, // WORLD'S END曲告知 2017年8月前半  |告知1
  1464, // WORLD'S END曲開放 2017年8月前半
  1465, // おすすめ曲 2017年8月
]);
