export const EVENT_IDS = Object.freeze([
  // A000
  3008, // AMAZON ep. I  |マップフラグ1
  3102, // AMAZON ep. EX  |マップフラグ1
  3351, // AMAZON ep. II  |マップフラグ1
  3453, // AMAZON ep. III  |マップフラグ1
  3608, // AMAZON ep. IV  |マップフラグ1
  3804, // AMAZON ep. V  |マップフラグ1
  4004, // AMAZON ep. VI  |マップフラグ1
  4104, // AMAZON ep. VII  |マップフラグ1
  4106, // イロドリミドリ ～ 波瀾の新入生編  |マップフラグ9
  4300, // 曲常駐 2019年10月  |曲常駐
  4301, // チーム機能  |新告知1
  4302, // リザルトでのFAST／LATE表示  |新告知2
  4303, // CHUNITHM-NET新機能まとめ  |新告知3
  4306, // CRYSTAL ep. I  |マップ告知1
  4307, // CRYSTAL ep. I  |マップフラグ1
  4310, // CRYSTAL ep. ∞  |マップフラグ1
  4311, // KING OF BAND '19  |クエスト告知1
  4312, // KING OF BAND '19  |クエストフラグ1
  4313, // 魔法科高校の劣等生  |マップ告知1
  4314, // 魔法科高校の劣等生  |マップフラグ1
  4315, // 魔法科高校の劣等生  |クエストフラグ1
  4316, // SSSS.GRIDMAN  |マップ告知1
  4317, // SSSS.GRIDMAN  |マップフラグ1
  4318, // SSSS.GRIDMAN  |クエストフラグ1
  4319, // エロマンガ先生  |マップ告知2
  4320, // エロマンガ先生  |マップフラグ2
  4321, // エロマンガ先生  |クエストフラグ2
  4322, // 追放者・掃討命令  |デュエル告知1
  4323, // 追放者・掃討命令  |デュエルフラグ1
  20005, // ACT 140  |ACT

  // A001
  4304, // 曲告知 2019年10月3回目  |曲告知1
  4305, // 曲開放 2019年10月3回目  |曲開放1
  4308, // イロドリミドリ ～ 決意の夏合宿編  |マップ告知1
  4309, // イロドリミドリ ～ 決意の夏合宿編  |マップフラグ1
  4324, // コース告知 2019年10月3回目  |コース告知1
  4325, // コース開放 2019年10月3回目  |コース開放1
  4326, // WORLD'S END曲告知 2019年10月3回目  |WE告知1
  4327, // WORLD'S END曲開放 2019年10月3回目  |WE開放1
  4328, // 曲開放 チーム限定 2019年10月3回目  |チーム曲開放1
  4329, // おすすめ曲 2019年10月3回目  |おすすめ

  // A005
  4400, // 曲常駐 2019年11月  |曲常駐
  4401, // CRYSTAL ep. EX  |マップ告知1
  4402, // CRYSTAL ep. EX  |マップフラグ1
  4403, // おすすめ曲 2019年11月1回目  |おすすめ
  4404, // ムービー 2019年11月1回目 START  |アドバ
  4450, // 曲告知 2019年11月2回目  |曲告知1
  4451, // 曲開放 2019年11月2回目  |曲開放1
  4452, // 結月ゆかり・紲星あかり・琴葉 茜・葵  |マップ告知1
  4453, // 結月ゆかり・紲星あかり・琴葉 茜・葵  |マップフラグ1
  4454, // 結月ゆかり・紲星あかり・琴葉 茜・葵  |クエストフラグ1
  4455, // PHANTASY STAR ONLINE 2  |マップ告知2
  4456, // PHANTASY STAR ONLINE 2  |マップフラグ2
  4457, // PHANTASY STAR ONLINE 2  |クエストフラグ2

  // A008
  4500, // 曲常駐 2019年12月  |曲常駐
  4501, // 曲告知 2019年12月1回目  |曲告知1
  4502, // 曲開放 2019年12月1回目  |曲開放1
  4503, // イロドリミドリ ～ 決意の夏合宿編  |マップ告知2
  4504, // イロドリミドリ ～ 決意の夏合宿編  |マップフラグ2
  4505, // GN計画  |クエスト告知1
  4506, // GN計画  |クエストフラグ1
  4507, // ネコぱら  |マップ告知1
  4508, // ネコぱら  |マップフラグ1
  4509, // ネコぱら  |クエストフラグ1
  4510, // Rocher Fantasy IV  |マップ告知1
  4511, // Rocher Fantasy IV  |マップフラグ1
  4512, // やきもちネリー  |デュエル告知1
  4513, // やきもちネリー  |デュエルフラグ1
  4514, // WORLD'S END曲告知 2019年12月1回目  |WE告知1
  4515, // WORLD'S END曲開放 2019年12月1回目  |WE開放1
  4516, // おすすめ曲 2019年12月1回目  |おすすめ
  4517, // ムービー 2019年12月1回目 単一指向性オーバーブルーム  |アドバ
  4550, // 曲告知 2019年12月2回目  |曲告知2
  4551, // 曲開放 2019年12月2回目  |曲開放2
  4552, // CRYSTAL ep. II  |マップ告知1
  4553, // CRYSTAL ep. II  |マップフラグ1
  4554, // とらドラ！  |マップ告知2
  4555, // とらドラ！  |マップフラグ2
  4556, // とらドラ！  |クエストフラグ2

  // A011
  4600, // 曲常駐 2020年1月  |曲常駐
  4601, // 曲告知 2020年1月1回目  |曲告知1
  4602, // 曲開放 2020年1月1回目  |曲開放1
  4603, // イロドリミドリ ～ 決意の夏合宿編  |マップ告知3
  4604, // イロドリミドリ ～ 決意の夏合宿編  |マップフラグ3
  4605, // おにまむしけ  |クエスト告知1
  4606, // おにまむしけ  |クエストフラグ1
  4607, // 賭ケグルイ××  |マップ告知1
  4608, // 賭ケグルイ××  |マップフラグ1
  4609, // 賭ケグルイ××  |クエストフラグ1
  4610, // てーきゅう  |マップ告知2
  4611, // てーきゅう  |マップフラグ2
  4612, // てーきゅう  |クエストフラグ2
  4613, // はらぺこなでしこ  |デュエル告知1
  4614, // はらぺこなでしこ  |デュエルフラグ1
  4615, // コース告知 2020年1月1回目  |コース告知1
  4616, // コース開放 2020年1月1回目  |コース開放1
  4617, // 曲開放 チーム限定 2020年1月1回目  |チーム曲開放1
  4618, // おすすめ曲 2020年1月1回目  |おすすめ
  4619, // ムービー 2020年1月1回目 みなえをチェック！  |アドバ
  4650, // 曲告知 2020年1月2回目  |曲告知2
  4651, // 曲開放 2020年1月2回目  |曲開放2
  4652, // 私に天使が舞い降りた！  |マップ告知1
  4653, // 私に天使が舞い降りた！  |マップフラグ1
  4654, // 私に天使が舞い降りた！  |クエストフラグ1

  // A014
  4700, // 曲常駐 2020年2月  |曲常駐
  4701, // 曲告知 2020年2月1回目  |曲告知1
  4702, // 曲開放 2020年2月1回目  |曲開放1
  4703, // ストライク・ザ・ブラッド  |マップ告知1
  4704, // ストライク・ザ・ブラッド  |マップフラグ1
  4705, // ストライク・ザ・ブラッド  |クエストフラグ1
  4706, // この素晴らしい世界に祝福を！2  |マップ告知2
  4707, // この素晴らしい世界に祝福を！2  |マップフラグ2
  4708, // この素晴らしい世界に祝福を！2  |クエストフラグ2
  4709, // 危うし！！　ダオ・トッテナ  |デュエル告知1
  4710, // 危うし！！　ダオ・トッテナ  |デュエルフラグ1
  4711, // おすすめ曲 2020年2月1回目  |おすすめ
  4750, // 曲告知 2020年2月2回目  |曲告知2
  4751, // 曲開放 2020年2月2回目  |曲開放2
  4752, // THE DARK SIDE NEMESIS  |クエスト告知1
  4753, // THE DARK SIDE NEMESIS  |クエストフラグ1
  4754, // 東方星蓮船  |マップ告知1
  4755, // 東方星蓮船  |マップフラグ1
  4756, // 東方Extra 1&2  |マップ告知6
  4757, // 東方Extra  |マップフラグ6
  4758, // 東方Extra 2  |マップフラグ4
  4759, // 東方風神録＆地霊殿  |マップ告知5
  4760, // 東方風神録  |マップフラグ5
  4761, // 東方地霊殿  |マップフラグ3
  4762, // 東方天空璋  |マップ告知2
  4763, // 東方天空璋  |マップフラグ2
  4764, // Rocher Fantasy IV  |マップ告知2
  4765, // Rocher Fantasy IV  |マップフラグ2
  4766, // 東方Project 火焔猫 燐、霊烏路 空  |クエスト告知1
  4767, // 東方Project 火焔猫 燐、霊烏路 空  |クエストフラグ1
  4768, // 東方クエスト 既存5個  |クエスト告知2
  4769, // 東方Project 博麗 霊夢＆霧雨 魔理沙  |クエストフラグ5
  4770, // 東方Project 霧雨 魔理沙＆アリス・マーガトロイド＆パチュリー・ノーレッジ  |クエストフラグ4
  4771, // 東方Project 博麗 霊夢＆東風谷 早苗  |クエストフラグ3
  4772, // 東方Project 伊吹 萃香、星熊 勇儀  |クエストフラグ3
  4773, // 東方Project チルノ  |クエストフラグ2
  4774, // WORLD'S END曲告知 2020年2月2回目  |WE告知1
  4775, // WORLD'S END曲開放 2020年2月2回目  |WE開放1

  // A017
  4800, // 曲常駐 2020年3月  |曲常駐
  4801, // 曲告知 2020年3月1回目  |曲告知1
  4802, // 曲開放 2020年3月1回目  |曲開放1
  4803, // CRYSTAL ep. III  |マップ告知1
  4804, // CRYSTAL ep. III  |マップフラグ1
  4805, // イロドリミドリ ～ 決意の夏合宿編  |マップ告知4
  4806, // イロドリミドリ ～ 決意の夏合宿編  |マップフラグ4
  4807, // スパルタ特訓  |デュエル告知1
  4808, // スパルタ特訓  |デュエルフラグ1
  4809, // おすすめ曲 2020年3月1回目  |おすすめ
  4810, // ムービー 2020年3月1回目 Road without Road  |アドバ
  4850, // 曲告知 2020年3月2回目  |曲告知2
  4851, // 曲開放 2020年3月2回目  |曲開放2
  4852, // ゾンビランドサガ  |マップ告知1
  4853, // ゾンビランドサガ  |マップフラグ1
  4854, // ゾンビランドサガ  |クエストフラグ1
  4855, // Hi☆sCoool! セハガール  |マップ告知2
  4856, // Hi☆sCoool! セハガール  |マップフラグ2
  4857, // Hi☆sCoool! セハガール  |クエストフラグ1
  4858, // グッズキャンペーン告知 第4弾  |グッズキャンペーン告知

  // A020
  4890, // COVID-19感染対策注意喚起  |特別告知1
  4900, // 曲常駐 2020年4月  |曲常駐
  4901, // 曲告知 2020年4月1回目  |曲告知1
  4902, // 曲開放 2020年4月1回目  |曲開放1
  4903, // THE LIGHT SIDE ORIGIN  |クエスト告知1
  4904, // THE LIGHT SIDE ORIGIN  |クエストフラグ1
  4905, // ゴブリンスレイヤー  |マップ告知1
  4906, // ゴブリンスレイヤー  |マップフラグ1
  4907, // ゴブリンスレイヤー  |クエストフラグ1
  4908, // 慰めの天使  |デュエル告知1
  4909, // 慰めの天使  |デュエルフラグ1
  4910, // 今日も明日も妖怪退治  |デュエル告知2
  4911, // 今日も明日も妖怪退治  |デュエルフラグ2
  4912, // WORLD'S END曲告知 2020年4月1回目  |WE告知1
  4913, // WORLD'S END曲開放 2020年4月1回目  |WE開放1
  4914, // おすすめ曲 2020年4月1回目  |おすすめ
  4950, // 曲告知 2020年4月2回目  |曲告知2
  4951, // 曲開放 2020年4月2回目  |曲開放2
  4952, // 緋弾のアリアAA  |マップ告知1
  4953, // 緋弾のアリアAA  |マップフラグ1
  4954, // 緋弾のアリアAA  |クエストフラグ1
  4955, // 温泉むすめ  |マップ告知2
  4956, // 温泉むすめ  |マップフラグ2
  4957, // 温泉むすめ  |クエストフラグ2
  4958, // コース告知 2020年4月2回目  |コース告知1
  4959, // コース開放 2020年4月2回目  |コース開放1
  4980, // 曲告知 2020年4月3回目  |曲告知3
  4981, // 曲開放 2020年4月3回目  |曲開放3
  4982, // Rocher Fantasy IV  |マップ告知3
  4983, // Rocher Fantasy IV  |マップフラグ3
]);
