export const EVENT_IDS = Object.freeze([
  // A000
  1, // アドバタイズムービー指定 デフォルト
  10, // ロンチ開始 通常マップ開放
  11, // ロンチ開始 曲開放
  100, // 魔法少女まどか☆マギカ  |告知1
  101, // 魔法少女まどか☆マギカ  |マップ1
  200, // 化物語  |告知1
  201, // 化物語  |マップ1

  // A017
  102, // 魔法少女まどか☆マギカ  |告知2
  103, // 魔法少女まどか☆マギカ  |マップ2
  202, // 化物語  |告知2
  203, // 化物語  |マップ2
  300, // STEINS;GATE  |告知1
  301, // STEINS;GATE  |マップ1
  400, // 蒼き鋼のアルペジオ  |告知1
  401, // 蒼き鋼のアルペジオ  |マップ1
  500, // 東方紅魔郷  |告知1
  501, // 東方紅魔郷  |マップ1
  700, // ペルソナ4 ダンシング・オールナイト  |告知1
  701, // ペルソナ4 ダンシング・オールナイト  |マップ1
  810, // アドバタイズムービー指定 7月 イロドリ
  820, // 曲開放 8月 BMS
  821, // アドバタイズムービー指定 8月 P4D
  830, // アドバタイズムービー指定 9月 追加マップ
  831, // アドバタイズムービー指定 9月 イロドリ
  832, // 曲常駐 9月 まどマギ/化物語
  834, // 曲開放 9月 BMS/イロドリ
  835, // おすすめ曲 9月
  840, // 曲常駐 10月 STEINS;GATE
  841, // 曲開放 10月 BMS
  842, // おすすめ曲 10月
  843, // 曲常駐 10月 P4D
  850, // アドバタイズムービー指定 11月 イロドリ
  851, // 曲常駐 11月 蒼き鋼のアルペジオ
  852, // 曲開放 11月 BMS/イロドリ
  853, // おすすめ曲 11月
  860, // アドバタイズムービー指定 12月 追加マップ
  862, // 曲開放 12月 etc
  863, // おすすめ曲 12月
  864, // 曲常駐 12月 東方紅魔郷
  865, // 曲常駐 12月 ORIGINAL

  // A020
  870, // アドバタイズムービー指定 1月 イロドリ
  871, // 曲開放 1月 BMS/イロドリ
  872, // おすすめ曲 1月
  873, // 曲常駐 1月 ORIGINAL
]);
