export const EVENT_IDS = Object.freeze([
  // A000
  102, // 魔法少女まどか☆マギカ  |告知2
  103, // 魔法少女まどか☆マギカ  |マップ2
  202, // 化物語  |告知2
  203, // 化物語  |マップ2
  880, // アドバタイズムービー指定 2月 デフォルト
  890, // ロンチ開始 曲開放 2月 ロンチリスト
  891, // ロンチ開始 マップ開放 2月 通常マップ
  900, // マップ開放 2月 通常マップ  |告知1
  902, // 曲告知 2月前半  |告知1
  904, // おすすめ曲 2月
  905, // WORLD'S END曲告知 2月前半  |告知1
  906, // WORLD'S END曲開放 2月前半
  907, // STEINS;GATE  |告知2
  908, // STEINS;GATE  |マップ2
  909, // ペルソナ4 ダンシング・オールナイト  |告知2
  910, // ペルソナ4 ダンシング・オールナイト  |マップ2
  911, // 冴えない彼女の育てかた  |告知1
  912, // 冴えない彼女の育てかた  |マップ1
  913, // イロドリミドリ  |告知1
  914, // イロドリミドリ  |マップ1
  915, // 曲告知 2月後半  |告知2
  916, // 曲開放 2月後半 BMS/イロドリ
  917, // WORLD'S END曲告知 2月後半  |告知2
  918, // WORLD'S END曲開放 2月後半

  // A005
  862, // 曲開放 12月 etc
  870, // アドバタイズムービー指定 1月 イロドリ
  871, // 曲開放 1月 BMS/イロドリ
  872, // おすすめ曲 1月
  873, // 曲常駐 1月 ORIGINAL
  903, // 曲常駐 2月 ORIGINAL
]);
